In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("transactions.csv")

In [3]:
df

      customer_id           name transaction_date       amount category
0             103  Charlie Davis       2022-01-01   759.037390        A
1             436    Alice Brown       2022-01-01  1096.181632        C
2             861    Alice Brown       2022-01-02  1158.623597        B
3             271     Bob Wilson       2022-01-02   859.027857      NaN
4             107     John Smith       2022-01-02   712.566977        C
...           ...            ...              ...          ...      ...
1045           85     John Smith       2023-12-27   761.082210        C
1046           78    Alice Brown       2023-12-27  1003.574745        B
1047          457  Charlie Davis       2023-12-28   832.511670        C
1048          878  Charlie Davis       2023-12-28   723.357978        B
1049            1     Bob Wilson       2023-12-30   721.611291        C

[1050 rows x 5 columns]

In [6]:
df.head()

   customer_id           name transaction_date       amount category
0          103  Charlie Davis       2022-01-01   759.037390        A
1          436    Alice Brown       2022-01-01  1096.181632        C
2          861    Alice Brown       2022-01-02  1158.623597        B
3          271     Bob Wilson       2022-01-02   859.027857      NaN
4          107     John Smith       2022-01-02   712.566977        C

In [7]:
df.tail()

      customer_id           name transaction_date       amount category
1045           85     John Smith       2023-12-27   761.082210        C
1046           78    Alice Brown       2023-12-27  1003.574745        B
1047          457  Charlie Davis       2023-12-28   832.511670        C
1048          878  Charlie Davis       2023-12-28   723.357978        B
1049            1     Bob Wilson       2023-12-30   721.611291        C

In [8]:
df.head(20)

    customer_id           name transaction_date       amount category
0           103  Charlie Davis       2022-01-01   759.037390        A
1           436    Alice Brown       2022-01-01  1096.181632        C
2           861    Alice Brown       2022-01-02  1158.623597        B
3           271     Bob Wilson       2022-01-02   859.027857      NaN
4           107     John Smith       2022-01-02   712.566977        C
5            72    Alice Brown       2022-01-03   749.303000        B
6           701    Alice Brown       2022-01-03  1280.716021        C
7            21     Bob Wilson       2022-01-03   877.266866        C
8           615     Bob Wilson       2022-01-07  1161.533889        C
9           122     John Smith       2022-01-07  1074.798141        B
10          467     Bob Wilson       2022-01-07   929.163784        B
11          215  Charlie Davis       2022-01-07   823.412357        C
12          331     Bob Wilson       2022-01-08   772.831851        C
13          459  Charlie Davis       2022-01-08  1069.007781        C
14           88     John Smith       2022-01-09  1164.780268        B
15          373     John Smith       2022-01-10  1086.342552        C
16          100     John Smith       2022-01-10  1018.181280        B
17          872     John Smith       2022-01-10   725.170734        B
18          664     John Smith       2022-01-11  1281.093267        A
19          131  Charlie Davis       2022-01-11  1179.228515        C

In [9]:
df.tail(16)

      customer_id           name transaction_date       amount category
1034          870    Alice Brown       2023-12-17  1270.557157        B
1035          771     John Smith       2023-12-17  1046.273552        C
1036          437    Alice Brown       2023-12-18   914.272696        C
1037           23     Bob Wilson       2023-12-19  1172.529452        A
1038          997    Alice Brown       2023-12-20   850.600830        C
1039          565     Bob Wilson       2023-12-21  1038.444417        C
1040          677     Bob Wilson       2023-12-22   915.147077        C
1041          714     Bob Wilson       2023-12-24  1093.978644        B
1042          458  Charlie Davis       2023-12-26   844.239348        B
1043           83    Alice Brown       2023-12-26   814.955767        C
1044          145     John Smith       2023-12-27  1250.943452        B
1045           85     John Smith       2023-12-27   761.082210        C
1046           78    Alice Brown       2023-12-27  1003.574745        B
1047          457  Charlie Davis       2023-12-28   832.511670        C
1048          878  Charlie Davis       2023-12-28   723.357978        B
1049            1     Bob Wilson       2023-12-30   721.611291        C

In [13]:
df.sample()
df.sample(10)

     customer_id           name transaction_date       amount category
880          531     John Smith       2023-09-06   942.573848        C
160           48    Alice Brown       2022-04-24   715.718025        C
677          762    Alice Brown       2023-04-12   990.044462        B
791           76    Alice Brown       2023-07-08  1077.734618        C
575           53  Charlie Davis       2023-02-01   891.320091        C
565          305  Charlie Davis       2023-01-26  1103.779973        C
701          929     Bob Wilson       2023-05-05   737.474556        B
974          959  Charlie Davis       2023-11-06  1175.885724        B
968          869  Charlie Davis       2023-11-03   799.449868        B
499          570  Charlie Davis       2022-12-14   768.303036        C

##### Missing Values

In [14]:
df.isna()

      customer_id   name  transaction_date  amount  category
0           False  False             False   False     False
1           False  False             False   False     False
2           False  False             False   False     False
3           False  False             False   False      True
4           False  False             False   False     False
...           ...    ...               ...     ...       ...
1045        False  False             False   False     False
1046        False  False             False   False     False
1047        False  False             False   False     False
1048        False  False             False   False     False
1049        False  False             False   False     False

[1050 rows x 5 columns]

In [15]:
df.isna().sum()

customer_id          0
name                 0
transaction_date     0
amount               0
category            45
dtype: int64

In [16]:
df.isnull()

      customer_id   name  transaction_date  amount  category
0           False  False             False   False     False
1           False  False             False   False     False
2           False  False             False   False     False
3           False  False             False   False      True
4           False  False             False   False     False
...           ...    ...               ...     ...       ...
1045        False  False             False   False     False
1046        False  False             False   False     False
1047        False  False             False   False     False
1048        False  False             False   False     False
1049        False  False             False   False     False

[1050 rows x 5 columns]

In [17]:
df.isnull().sum()

customer_id          0
name                 0
transaction_date     0
amount               0
category            45
dtype: int64

In [18]:
df

      customer_id           name transaction_date       amount category
0             103  Charlie Davis       2022-01-01   759.037390        A
1             436    Alice Brown       2022-01-01  1096.181632        C
2             861    Alice Brown       2022-01-02  1158.623597        B
3             271     Bob Wilson       2022-01-02   859.027857      NaN
4             107     John Smith       2022-01-02   712.566977        C
...           ...            ...              ...          ...      ...
1045           85     John Smith       2023-12-27   761.082210        C
1046           78    Alice Brown       2023-12-27  1003.574745        B
1047          457  Charlie Davis       2023-12-28   832.511670        C
1048          878  Charlie Davis       2023-12-28   723.357978        B
1049            1     Bob Wilson       2023-12-30   721.611291        C

[1050 rows x 5 columns]

#### Categorical/Qualtative data
#### Numerical/Quantitative data

In [19]:
df.dtypes

customer_id           int64
name                 object
transaction_date     object
amount              float64
category             object
dtype: object

In [20]:
df['transaction_date']

0       2022-01-01
1       2022-01-01
2       2022-01-02
3       2022-01-02
4       2022-01-02
           ...
1045    2023-12-27
1046    2023-12-27
1047    2023-12-28
1048    2023-12-28
1049    2023-12-30
Name: transaction_date, Length: 1050, dtype: object

In [22]:
from datetime import datetime

ans = datetime.strptime(df['transaction_date'][1046],"%Y-%m-%d").strftime("%d-%m-%Y")
ans

'27-12-2023'

In [30]:
df

      customer_id           name transaction_date       amount category
0             103  Charlie Davis       2022-01-01   759.037390        A
1             436    Alice Brown       2022-01-01  1096.181632        C
2             861    Alice Brown       2022-01-02  1158.623597        B
3             271     Bob Wilson       2022-01-02   859.027857      NaN
4             107     John Smith       2022-01-02   712.566977        C
...           ...            ...              ...          ...      ...
1045           85     John Smith       2023-12-27   761.082210        C
1046           78    Alice Brown       2023-12-27  1003.574745        B
1047          457  Charlie Davis       2023-12-28   832.511670        C
1048          878  Charlie Davis       2023-12-28   723.357978        B
1049            1     Bob Wilson       2023-12-30   721.611291        C

[1050 rows x 5 columns]

In [32]:
df['transaction_date'].head(20)

0     2022-01-01
1     2022-01-01
2     2022-01-02
3     2022-01-02
4     2022-01-02
5     2022-01-03
6     2022-01-03
7     2022-01-03
8     2022-01-07
9     2022-01-07
10    2022-01-07
11    2022-01-07
12    2022-01-08
13    2022-01-08
14    2022-01-09
15    2022-01-10
16    2022-01-10
17    2022-01-10
18    2022-01-11
19    2022-01-11
Name: transaction_date, dtype: object

In [33]:
df['transaction_date'] = pd.to_datetime(df["transaction_date"])

In [34]:
df['transaction_date']

0      2022-01-01
1      2022-01-01
2      2022-01-02
3      2022-01-02
4      2022-01-02
          ...
1045   2023-12-27
1046   2023-12-27
1047   2023-12-28
1048   2023-12-28
1049   2023-12-30
Name: transaction_date, Length: 1050, dtype: datetime64[ns]

In [35]:
df

      customer_id           name transaction_date       amount category
0             103  Charlie Davis       2022-01-01   759.037390        A
1             436    Alice Brown       2022-01-01  1096.181632        C
2             861    Alice Brown       2022-01-02  1158.623597        B
3             271     Bob Wilson       2022-01-02   859.027857      NaN
4             107     John Smith       2022-01-02   712.566977        C
...           ...            ...              ...          ...      ...
1045           85     John Smith       2023-12-27   761.082210        C
1046           78    Alice Brown       2023-12-27  1003.574745        B
1047          457  Charlie Davis       2023-12-28   832.511670        C
1048          878  Charlie Davis       2023-12-28   723.357978        B
1049            1     Bob Wilson       2023-12-30   721.611291        C

[1050 rows x 5 columns]

In [36]:
df.isnull().sum()

customer_id          0
name                 0
transaction_date     0
amount               0
category            45
dtype: int64

In [37]:
df.dropna(inplace=True)

In [38]:
df

      customer_id           name transaction_date       amount category
0             103  Charlie Davis       2022-01-01   759.037390        A
1             436    Alice Brown       2022-01-01  1096.181632        C
2             861    Alice Brown       2022-01-02  1158.623597        B
4             107     John Smith       2022-01-02   712.566977        C
5              72    Alice Brown       2022-01-03   749.303000        B
...           ...            ...              ...          ...      ...
1045           85     John Smith       2023-12-27   761.082210        C
1046           78    Alice Brown       2023-12-27  1003.574745        B
1047          457  Charlie Davis       2023-12-28   832.511670        C
1048          878  Charlie Davis       2023-12-28   723.357978        B
1049            1     Bob Wilson       2023-12-30   721.611291        C

[1005 rows x 5 columns]

In [39]:
df.isna().sum()

customer_id         0
name                0
transaction_date    0
amount              0
category            0
dtype: int64

In [40]:
df = pd.read_csv("transactions.csv")

In [41]:
df.isna().sum()

customer_id          0
name                 0
transaction_date     0
amount               0
category            45
dtype: int64

In [42]:
df['category'] = df["category"].fillna("-")

In [43]:
df.isna().sum()

customer_id         0
name                0
transaction_date    0
amount              0
category            0
dtype: int64

In [44]:
df

      customer_id           name transaction_date       amount category
0             103  Charlie Davis       2022-01-01   759.037390        A
1             436    Alice Brown       2022-01-01  1096.181632        C
2             861    Alice Brown       2022-01-02  1158.623597        B
3             271     Bob Wilson       2022-01-02   859.027857        -
4             107     John Smith       2022-01-02   712.566977        C
...           ...            ...              ...          ...      ...
1045           85     John Smith       2023-12-27   761.082210        C
1046           78    Alice Brown       2023-12-27  1003.574745        B
1047          457  Charlie Davis       2023-12-28   832.511670        C
1048          878  Charlie Davis       2023-12-28   723.357978        B
1049            1     Bob Wilson       2023-12-30   721.611291        C

[1050 rows x 5 columns]

In [45]:
df["amount"].fillna(df["amount"].mean(),inplace=True)

C:\Users\bhatt\AppData\Local\Temp\ipykernel_18532\126318218.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["amount"].fillna(df["amount"].mean(),inplace=True)

In [46]:
df.duplicated()

0       False
1       False
2       False
3       False
4       False
        ...
1045    False
1046    False
1047    False
1048    False
1049    False
Length: 1050, dtype: bool

In [47]:
print(df.duplicated().sum())

0

In [48]:
df.drop_duplicates(inplace=True)

In [49]:
df.duplicated().sum()

np.int64(0)

In [50]:
df.dtypes

customer_id           int64
name                 object
transaction_date     object
amount              float64
category             object
dtype: object

In [52]:
ndf = df["amount"].astype("int32")

In [53]:
ndf.dtypes

dtype('int32')

In [54]:
df

      customer_id           name transaction_date       amount category
0             103  Charlie Davis       2022-01-01   759.037390        A
1             436    Alice Brown       2022-01-01  1096.181632        C
2             861    Alice Brown       2022-01-02  1158.623597        B
3             271     Bob Wilson       2022-01-02   859.027857        -
4             107     John Smith       2022-01-02   712.566977        C
...           ...            ...              ...          ...      ...
1045           85     John Smith       2023-12-27   761.082210        C
1046           78    Alice Brown       2023-12-27  1003.574745        B
1047          457  Charlie Davis       2023-12-28   832.511670        C
1048          878  Charlie Davis       2023-12-28   723.357978        B
1049            1     Bob Wilson       2023-12-30   721.611291        C

[1050 rows x 5 columns]

In [55]:
df.dtypes

customer_id           int64
name                 object
transaction_date     object
amount              float64
category             object
dtype: object

In [56]:
df.to_csv("filtered_transactions.csv",index=False)

In [57]:
df

      customer_id           name transaction_date       amount category
0             103  Charlie Davis       2022-01-01   759.037390        A
1             436    Alice Brown       2022-01-01  1096.181632        C
2             861    Alice Brown       2022-01-02  1158.623597        B
3             271     Bob Wilson       2022-01-02   859.027857        -
4             107     John Smith       2022-01-02   712.566977        C
...           ...            ...              ...          ...      ...
1045           85     John Smith       2023-12-27   761.082210        C
1046           78    Alice Brown       2023-12-27  1003.574745        B
1047          457  Charlie Davis       2023-12-28   832.511670        C
1048          878  Charlie Davis       2023-12-28   723.357978        B
1049            1     Bob Wilson       2023-12-30   721.611291        C

[1050 rows x 5 columns]